app/Models/AsistenModel.php

    public function getAsisten($nama = false)
    {
        if ($nama == false) {
            return $this->findAll();
---
SELECT *
FROM `asisten`